10/data/attachments/bb73a8c76ffb81e7.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_e68324d6-d2cf-4cef-b647-44c996e929c9</nif:username>
            <nif:friendToBeAdded>Willie_degree_Actions_13955_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>